In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns
import datetime
plt.style.use('ggplot')

In [10]:
df_apr=pd.read_csv('uber-raw-data-apr14.csv')

In [11]:
df_apr.head()

          Date/Time      Lat      Lon    Base
0  4/1/2014 0:11:00  40.7690 -73.9549  B02512
1  4/1/2014 0:17:00  40.7267 -74.0345  B02512
2  4/1/2014 0:21:00  40.7316 -73.9873  B02512
3  4/1/2014 0:28:00  40.7588 -73.9776  B02512
4  4/1/2014 0:33:00  40.7594 -73.9722  B02512

In [12]:
df_apr.shape

(564516, 4)

In [13]:
df_apr.tail()

                 Date/Time      Lat      Lon    Base
564511  4/30/2014 23:22:00  40.7640 -73.9744  B02764
564512  4/30/2014 23:26:00  40.7629 -73.9672  B02764
564513  4/30/2014 23:31:00  40.7443 -73.9889  B02764
564514  4/30/2014 23:32:00  40.6756 -73.9405  B02764
564515  4/30/2014 23:48:00  40.6880 -73.9608  B02764

Converting column 'Date/Time' from string to datetime

In [14]:
df_apr['Date/Time']=pd.to_datetime(df_apr['Date/Time'],format='%m/%d/%Y %H:%M:%S')

In [15]:
df_apr.head(10)

            Date/Time      Lat      Lon    Base
0 2014-04-01 00:11:00  40.7690 -73.9549  B02512
1 2014-04-01 00:17:00  40.7267 -74.0345  B02512
2 2014-04-01 00:21:00  40.7316 -73.9873  B02512
3 2014-04-01 00:28:00  40.7588 -73.9776  B02512
4 2014-04-01 00:33:00  40.7594 -73.9722  B02512
5 2014-04-01 00:33:00  40.7383 -74.0403  B02512
6 2014-04-01 00:39:00  40.7223 -73.9887  B02512
7 2014-04-01 00:45:00  40.7620 -73.9790  B02512
8 2014-04-01 00:55:00  40.7524 -73.9960  B02512
9 2014-04-01 01:01:00  40.7575 -73.9846  B02512

Replacing Date/Time with more suitable columns

In [16]:
df_apr['date']=df_apr['Date/Time'].dt.day
df_apr['weekday']=df_apr['Date/Time'].dt.weekday
df_apr['hour']=df_apr['Date/Time'].dt.hour
df_apr['min']=df_apr['Date/Time'].dt.minute
df_apr['weekno']=df_apr['date']//7 +1 #Week starting from Sunday

In [28]:
#df_apr=df_apr.drop(['Date/Time'],axis=1)
x=df_apr['Date/Time'].dt.weekofyear

In [29]:
x

0         14
1         14
2         14
3         14
4         14
          ..
564511    18
564512    18
564513    18
564514    18
564515    18
Name: Date/Time, Length: 564516, dtype: int64